app/models/token.rb

  def self.access_token
    t = Token.last
---
SELECT  "tokens".* FROM "tokens" ORDER BY "tokens"."id" DESC LIMIT $1  [["LIMIT", 1]]